SQL/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "XPbLxTJQ0DzXlDa3WiBTsg"], ["user_id", 1], ["created_at", "2019-06-21 02:28:10.208304"], ["updated_at", "2019-06-21 02:28:10.208304"]]
---
    def self.create!(long_url, user)
        user_id = user.id
        short_url = random_code
        self.create(short_url: random_code, long_url: long_url, user_id: user_id)

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."long_url" = $1 LIMIT $2  [["long_url", "x6sLxnOMH7eku25U82_OUQ"], ["LIMIT", 1]]
---
    def self.random_code
        code = SecureRandom.urlsafe_base64
        while self.exists?(:long_url => code)