SQL/URLShortener/app/models/visit.rb

    def self.record_visit!(user, short_url)
        visitor_id = user.id
        shortened_url_id = ShortenedUrl.where(:short_url => short_url).first.id
        self.create(visitor_id: visitor_id, url_id: shortened_url_id)
---
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 ORDER BY "shortened_urls"."id" ASC LIMIT $2  [["short_url", "XPbLxTJQ0DzXlDa3WiBTsg"], ["LIMIT", 1]]
INSERT INTO "visits" ("visitor_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["visitor_id", 1], ["url_id", 1], ["created_at", "2019-06-21 02:47:14.516840"], ["updated_at", "2019-06-21 02:47:14.516840"]]

    def self.last_visit
        Visit.all.last.url.short_url
---
SELECT  "visits".* FROM "visits" ORDER BY "visits"."id" DESC LIMIT $1  [["LIMIT", 1]]