Rails/ArtworkSharing/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artwork_id", 3], ["viewer_id", 4], ["created_at", "2019-06-30 14:18:44.355798"], ["updated_at", "2019-06-30 14:18:44.355798"]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_shares_params)
        if artwork_share.save