Rails/ArtworkSharing/app/controllers/artworks_controller.rb

    def index
        all_artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def show
        id = params[:id]
        artwork = Artwork.find(id)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]