Rails/ArtworkSharing/app/controllers/comments_controller.rb

    def index
        case
        when params[:artwork_id]
            comments = Artwork.find(params[:artwork_id]).comments
        when params[:commenter_id]
            comments = User.find(params[:commenter_id]).comments
        else
            comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = ?  [["artwork_id", 2]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = ?  [["commenter_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter_id", 4], ["artwork_id", 3], ["body", "It looks terrifying"], ["created_at", "2019-07-01 08:24:20.822550"], ["updated_at", "2019-07-01 08:24:20.822550"]]