Rails/ArtworkSharing/app/controllers/users_controller.rb

    def index
        if params[:search_user]
            users = User.where('users.username LIKE ?', "%#{params[:search_user]}%")
        else
            users = User.all
---
SELECT "users".* FROM "users" WHERE (users.username LIKE '%bryan%')

    def show
        id = params[:id]
        render json: User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]