SQL/PollsApp/app/models/response.rb

    def not_duplicate_response
        previous_response = Response.find_by(user_id: self.user_id, question_id: self.question_id)
---
SELECT  "responses".* FROM "responses" WHERE "responses"."user_id" = $1 AND "responses"."question_id" = $2 LIMIT $3  [["user_id", 1], ["question_id", 1], ["LIMIT", 1]]

    def respondent_is_not_poll_author
        poll_author_id = Poll.joins(questions: :answer_choices).where("answer_choices.id = ? AND questions.id = ?", self.answer_choice_id, self.question_id).pluck('polls.user_id').first
---
SELECT polls.user_id FROM "polls" INNER JOIN "questions" ON "questions"."poll_id" = "polls"."id" INNER JOIN "answer_choices" ON "answer_choices"."question_id" = "questions"."id" WHERE (answer_choices.id = NULL AND questions.id = NULL)